<?php
const USER_GUONEI = 'N5879106';
const PWD_GUONEI = 'UnLQ0ykXSua0b0';
const ADD_USER = '【棠果旅居】你的棠果Ebooking账号创建成功，用户名为：%s密码为：%s';
const EDIT_PWD = '【棠果旅居】你的棠果Ebooking密码重置成功，新密码为：%s';
return [
    'adminEmail' => 'admin@example.com',
    'sex' => [
        0 => '男',
        1 => '女',
        2 => '保密',
    ],
    // admin:ys time:2017/11/10 content:房源是否实时预定（0.需要确认 1.可实时预定）
    'house_is_realtime_type' => [
        0 => '需确认入住',
        1 => '可实时预定',
    ],
    
    'order_status' => [
        1 => '待确认',
        3 => '已取消',
        11 => '待付款',
        12 => '已拒绝',
        21 => '待入住',
        22 => '支付失败',
        31 => '已入住',
        32 => '已完成',
        34 => '已结算',
        41 => '支付超时',
        42 => '房东确认超时',
        43 => '房源已被占用',
    ],
    'travel' => [
        //订单状态
        'order_status' => [
            3  => '已取消',
            11 => '待支付',
            21 => '已支付',
            31 => '待确认',
            32 => '已确认',
            33 => '已拒绝',
            50 => '已完成',
            51 => '待退款',
            52 => '退款中',
            53 => '已退款',
            54 => '退款失败',
        ],
    ],
    'refund_status' => [
        1 => '待退款',
        3 => '退款已确认',
        4 => '退款中',
        5 => '退款完成',
        6 => '拒绝退款',
    ],
    'house_laiyuan' => [
        1 => '棠果',
        2 => '番茄',
        3 => '同程',
    ],
    'house_status' => [
        -1 => '待完善',
        0 => '审核中',
        1 => '正常',
        2 => '冻结',
        3 => '未通过',
        4 => '保存中'
    ],
    'room_type' => [
        67 => '精品公寓',
        72 => '独立屋',
        77 => 'loft',
        78 => '小木屋',
        79 => '独栋别墅',
        81 => '青年宿舍',
        88 => '蒙古包',
        91 => '普通民居',
        93 => '家庭宾馆',
        94 => '乡间村舍',
        95 => '精品酒店',
        97 => '农家院',
        98 => '度假村',
        99 => '海景房'
    ],
    'roommode' => [
        1 => '整租',
        2 => '单间',
        3 => '床位'
    ],
    'pay_type' => [
        0 => '暂无',
        1 => '支付宝',
        2 => '微信'
    ],
    'card_type' => [
        0 => '身份证',
        1 => '护照',
        2 => '军官证'
    ],
    'constellation' => [
        1 => '水瓶', 2 => '双鱼', 3 => '白羊', 4 => '金牛', 5 => '双子', 6 => '巨蟹', 7 => '狮子', 8 => '处女', 9 => '天枰', 10 => '天蝎', 11 => '射手', 12 => '摩羯'
    ],
    'impress_type' => [0 => '人文历史', 1 => '自然风景', 2 => '舌尖文化', 3 => '散文随笔'],
    'note_obj' => [0 => '一个人', 1 => '小两口', 2 => '亲子游', 3 => '带父母', 4 => '好朋友', 5 => '其他'],
    'note_type' => [0 => '自由行', 1 => '半自由', 2 => '跟团', 3 => '徒步', 4 => '自驾', 5 => '游轮', 6 => '骑行'],

    'higo_status' => [
        0 => '待审核',
        1 => '已通过',
        2 => '已下线',
        3 => '未通过',
    ],
//    'impress_type' => [
//        1 => '人文历史', 2 => '自然风景', 3 => '舌尖文化', 4 => '散文随笔'
//    ],
    'tag' => [1 => '派对交友', 2 => '益智游戏', 3 => '演出赛事', 4 => '周边户外', 5 => '文艺展览', 6 => '沙龙讲座', 7 => '美食分享', 8 => '城市探索', 9 => '个性定制', 10 => '亲子活动', 11 => '景点门票', 12 => 'DIY体验'],
    'impress_identity' => [
        0 => '公司',
        1 => '个人',
        2 => '无'
    ],
    'status_order' => [
        0 => '-',
        3 => '已取消',
        11 => '待支付',
        21 => '已支付',
        31 => '待确认',
        32 => '已确认',
        33 => '商家已取消',
        42 => '支付超时取消',
        43 => '商家确认超时',
        44 => '用户手动退款',
        50 => '已完成',
        51 => '已结算'
    ],
    'stauts_refund' => [
        51 => '待退款',
        52 => '退款中',
        53 => '已退款',
        54 => '退款失败'
    ],
    'type' => [
        0 => '-',
        2 => '当地活动',
        3 => '主题嗨go',
        5 => '当地向导'
    ],
    'is_confirm' => [
        0 => '无需确认',
        1 => '需要确认'
    ],
    'search_type' => [
        1 => '下单日期',
        2 => '入住日期',
        3 => '离店日期'
    ],
    'pay_status' => [
        1 => '未支付',
        2 => '已支付'
    ],
    'play_money' => [
        0 => '未打款',
        1 => '已打款',
        2 => '打款失败'
    ],
    'play_type' => [
        1 => '微信',
        2 => '支付宝',
        3 => '银行卡'
    ],
    //定制类型
    'custom_type' => [
        1 => '企业定制',
        2 => '个人定制',
        3 => '帮我推荐'
    ],
    //当地住宿
    'stayed_status' => [
        1 => '三星（舒适）',
        2 => '四星（高档）',
        3 => '五星（豪华）',
        4 => '特色客栈',
        5 => '连锁',
        6 => '不限',
        7 => '自理'
    ],
    //定制主题
    'customized_theme_status' => [
        1 => '常规定制',
        2 => '企业团建',
        3 => '会议旅行',
        4 => '商务访问',
        5 => '其他'
    ],
    //游玩主题
    'play_theme_status' => [
        1 => '常规定制',
        2 => '快乐亲子',
        3 => '蜜月婚拍',
        4 => '户外探险',
        5 => '其他'
    ],
    //跟进状态
    'follow_status' => [
        0 => '未跟进',
        1 => '已跟进',
        2 => '已完成'
    ],
    //打款状态
    'settle_status' => [
        0 => '未打款',
        1 => '已打款',
        2 => '打款失败'
    ],
    //结算状态
    'close_account' => [
        0 => '未结算',
        1 => '已结算'
    ],
    //是否状态
    'is_status' => [
        0 => '否',
        1 => '是'
    ],
    //状态
    'status' => [
        1 => '启用',
        2 => '禁用'
    ],
    //证件类型
    'IDcard_type' => [
        0 => '身份证',
        2 => '军官证',
        1 => '护照'
    ],
    //床型信息
    'bed_type' => [
        1 => '双人床',
        2 => '单人床',
        3 => '大床',
        4 => '圆床',
        5 => '榻榻米',
        6 => '沙发床',
        7 => '双层床',
        8 => '床垫',
        9 => '其它'

    ],
    //房屋退订等级
    'refund_strategy' => [
        1 => '灵活',
        2 => '中等',
        3 => '严格',
        4 => '极严',
    ],
    //性别（房源）
    'house_sex' => [
        0 => '无要求',
        1 => '男',
        2 => '女'
    ],

    //接纳外宾
    'is_welcome' => [
        0 => '不接待',
        1 => '接待'
    ],

    //酒店类型
    'hotel_type' => [
        '1' => '经济型',
        '2' => '舒适型',
        '3' => '高端型',
        '4' => '豪华型',
        '5' => '二星级',
        '6' => '三星级',
        '7' => '四星级',
        '8' => '五星级',
    ],

    //最早入住时间
    'in_time' => [
        '12' => '12:00',
        '14' => '14:00',
    ],

    //最晚退房时间
    'out_time' => [
        '12' => '12:00',
        '14' => '14:00',
    ],

    //售卖时段
    'sale_time' => [
        '1' => '全部时间',
        '2' => '06:00至14:00',
    ],

    //酒店状态
    'hotel_status' => [
        '0' => '停用',
        '1' => '启用',
    ],
    //酒店结算状态
    'hotel_settle_status' => [
        0 => '未结算',
        1 => '已结算',
        2 => '打款失败'
    ],

    //酒店审核状态
    'hotel_check_status' => [
        '0' => '待审核',
        '1' => '已通过',
        '2' => '已拒绝',
        '3' => '已关闭',
    ],

    //酒店早餐
    'hotel_breakfast' => [
        '0' => '不含早餐',
        '1' => '双早',
        '2' => '单早',
        '3' => '自助早餐',
        '4' => '收费早餐',
    ],

    //酒店取消政策
    'hotel_refund_type' => [
        '0' => '限时取消',
        '1' => '不可取消',
        '2' => '随时取消',
    ],

    //酒店取消时间
    'hotel_refund_time' => [
        '0' => '24:00',
        '1' => '22:00',
        '2' => '20:00',
        '3' => '18:00',
        '4' => '16:00',
        '5' => '12;00',
        '6' => '前一天20:00',
        '7' => '前一天18:00',
        '8' => '前两天18:00',
        '9' => '前三天18:00',
        '10' => '前一周',
    ],

    //酒店床型
    'hotel_bed_type' => [
        0  => '大床',
        1  => '双床',
        2  => '大床/双床',
        3  => '水床',
        4  => '单人床',
        5  => '电动床',
        6  => '榻榻米',
        7  => '炕',
        8  => '上下铺',
        9  => '高低床',
        10 => '圆床',
        11 => '其他',
    ],
    //楼层类型
    'hotel_floor_type' => [
        0 => '地上',
        1 => '地下',
        2 => '半地下',
    ],
    //酒店有无窗
    'hotel_is_window' => [
        '0' => '无窗',
        '1' => '有窗',
    ],

    //酒店房型状态
    'hotel_house_status' => [
        '0' => '暂停售卖',
        '1' => '正常售卖',
    ],

    //供应商类型
    'hotel_supplier_type' => [
        '1' => '个体工商',
        '2' => '集团连锁',
        '3' => '管理公司',
        '4' => '平台供应商',
    ],

    //供应商结算周期
    'hotel_supplier_settle_type' => [
        '2' => '单结',
        '0' => '周结',
        '1' => '月结',
    ],

    //酒店供应商基本信息菜单
    'hotel_supplier_nav' => [
        [
            'route' => 'add',
            'value' => '基本信息',
        ],
        [
            'route' => 'account',
            'value' => '账号信息',
        ],
        [
            'route' => 'credentials',
            'value' => '资质管理',
        ],
        [
            'route' => 'relation',
            'value' => '关联酒店',
        ],
        [
            'route' => 'settlement',
            'value' => '财务结算',
        ],
        [
            'route' => 'user',
            'value' => '账号管理',
        ]
    ],
    //登陆账号状态
    'hotel_login_status' => [
        0 => '开启',
        1 => '关闭',
    ],
    // 酒店供应商账号信息
    'hotel_supplier_account_type' => [
        '1' => '对公账户',
        '2' => '对私账户',
        '3' => '集团账户'
    ],
    // 酒店供应商账号信息
    'hotel_supplier_account_type_insert' => [
        '1' => '对公账户',
        '2' => '对私账户',
    ],

    //供应商状态
    'hotel_supplier_status' => [
        '0' => '待审核',
        '1' => '已通过',
        '2' => '已拒绝',
        '3' => '已关闭'
    ],

    //开票状态
    'hotel_supplier_invoice_status' => [
        '0' => '未开票',
        '1' => '已开票'
    ],

    //二维码自定义参数
    'qrcode_custom1' => [
        '1' => '俱乐部1',
        '2' => '俱乐部2',
    ],

    //酒店和供应商的关联状态
    'hotel_relation_status' => [
        '0' => '未关联',
        '1' => '已关联',
    ],

    //酒店图片类别
    'hotel_img_type' => [
        '1' => '外观',
        '2' => '设施',
        '3' => '卧室',
        '4' => '客厅',
    ],

    'up_type' => [
        0 => 'app上传',
        1 => '特殊上传',
        2 => '合伙人上传',
        3 => 'PC房东端',
        4 => '番茄来了',
        5 => '同程',
    ],

    //专题活动状态
    'thematic_status' => [
        '1' => '已上线',
        '2' => '已下线',
        '3' => '未开始',
        '4' => '已到期',
    ],

    //酒店订单状态
    'hotel_order_status' => [
        '0' => '待支付',
        '11' => '待确认',
        '12' => '待入住',
        '13' => '已入住',
        '14' => '已离店(待点评)',
        '15' => '已点评',
        '21' => '已取消',
        '31' => '退款中',
        '32' => '已退款',
        '33' => '退款失败',
        '34' => '酒店拒单',
    ],

    //旅游线路+当地活动的状态
    'travel_status' => [
        '-1' => '已删除',
        '0' => '未审核',
        '1' => '上线',
        '2' => '下线',
        '3' => '未通过',
        '4' => '草稿',
    ],
//    公司注册地类型
    'reg_addr_type' => [
        1 => '大陆',
        2 => '港澳',
        3 => '台湾',
        4 => '海外',

    ],
    'group_type' => [
        1 => '旅行社',
        2 => '非旅行社'
    ],

    //优惠券类型
    'coupon_type' => [
        '0' => '通用',
        '1' => '民宿',
        '2' => '旅行',
        '3' => '酒店'
    ],

    //优惠券时效类型
    'coupon_forever' => [
        '0' => '区间内有效',
        '1' => '永久有效'
    ],

    //优惠券状态
    'coupon_status' => [
        '0' => '待激活',
        '1' => '待使用',
        '2' => '占用中',
        '3' => '已使用',
        '4' => '已失效'
    ],
    //优惠券指定产品需要的表
    'coupon_tname_list' => [
        'house_details' => '民宿',
        'travel_activity' => '当地活动',
        'travel_higo' => '主题嗨go',
        'hotel' => '酒店'
    ],
    //优惠券指定产品需要的表对应的类型
    'coupon_tname_type' => [
        '0' => '民宿',
        '1' => '当地活动',
        '2' => '主题嗨go',
        '3' => '酒店'
    ],
    //当地活动活动类型
    'travel_activity_type' => [
        '0' => '线上',
        '1' => '线下',
    ],

    'shop' => [
        //商品状态
        'goods_status' => [
            0 => '待申请上架', 10 => '审核中', 11 => '不通过', 20 => '在售中', 30 => '仓库中'

        ],
        'goods_category' => [
            1 => '旅行',
            2 => '特产',
            3 => '科技',
            4 => '家居'
        ],
        //退款单状态
        'refund_status' => [
            0 => '待审核', 5 => '拒绝', 10 => '待发货', 11 => '已发货', 15 => '待退款', 20 => '已完成', 25 => '退款关闭'

        ],
        'refund_result' => [
            0 => '未完成', 1 => '退货', 2 => '驳回',

        ],
        'operate_category' => [
            1 => '旅行', 2 => '特产', 3 => '科技', 4 => '家居'
        ],
        'order_status' => [
            0 => '待支付', 5 => '待发货', 10 => '已发货', 15 => '退款中', 20 => '已完成', 25 => '已关闭',
        ],
        'shop_purchase' => [
            0 => '待发货',2 => '待付款', 3 => '完成', 4 => '作废'

        ],
        'shop_receive' => [
            1 => '商城应收', 2 => '商家应退', 3 => '积分兑换',4=>'积分返还'
        ],
        'receive_status' => [
            1 => '待收款', 2 => '已完成', 3 => '作废'
        ],
        'pay_status' => [
            1 => '待付款', 2 => '已付款', 3 => '已取消'

        ],

        'pay_type' => [
            1 => '支付宝', 2 => '微信', 3 => '积分'
        ],


    ],

    'error_defaule' => [
        'code' => '404',
        'msg' => '您所访问的页面不存在，或者已经被删除',
    ],

    'travel_language' => [
        0 => '普通话',
        1 => '英语',
        2 => '日语',
        3 => '韩语',
        4 => '其他',
    ],

    'coupon_activity_status' => [
        0 => '正常',
        1 => '禁用',
    ],
    //酒店结算
    'handle_hotel_settle_type' => [
        'month' => 1,
        'week' => 0,
    ],
    //酒店管理-酒店联系人-短信发送状态
    'hotel_contact_sms_status' => [
        0 => '已开启',
        1 => '已关闭'
    ],

    //发送短信的场景
    'sms_scene' => [
        0 => '生成订单未支付5分钟后提示支付',
        1 => '支付成功无需确认',
        2 => '支付成功需要确认',
        3 => '达人确认订单',
        4 => '达人拒绝订单',
        5 => '体验日期前一天提醒（发送短信时间：12：00）',
        6 => '用户申请退款',
        7 => '退款成功',
        8 => '退款失败',
        9 => 'KA定制发送短信',
    ],
    //机票banner广告状态
    'plane_banner_status' => [
        1 => '在线',
        2 => '已下线',
    ],
    //机票供应商类别
    'plane_supplier_type' => [
        1 => '机票供应商',
        2 => '航空公司'
    ],
    //保险供应商类别
    'plane_insurance_type' => [
        1 => '保险经纪公司',
        2 => '保险公司',
    ],
    //机票or保险供应商状态
    'plane_suppler_status' => [
        1 => '在线',
        2 => '已下线',
    ],
    //保险类型
    'plane_emplane_insurance_type' => [
        0 => '-',
        1 => '航意险',
        2 => '航延险',
    ],
    //机票后端订单状态显示
    'plane_ticket_backend_status' => [
        1 => '待支付',
        2 => '已支付待出票',
//        3 => '已出票未出保',
//        4 => '出票超时',
        5 => '待退票',
        6 => '出票失败',
//        8 => '已退票未退保',
        9 => '已退票未退款',
        10 => '出票成功',
        11 => '订单取消',
        12 => '退款完成',
    ],
    //机票订单详细状态描述
    'plane_ticket_order_status_describe' => require __DIR__.'/plane_ticket_order_status_describe.php',
    //后台机票订单详细状态转化为后台展示状态
    'plane_ticket_backend_show_status' => require __DIR__.'/plane_ticket_backend_show_status.php',
    //机票支付状态-订单详情页-ticket_pay
    'plane_ticket_pay_status' => [
        1 => '交易成功',
        2 => '交易失败'
    ],
    'plane_ticket_refund_status' => [
        1 => '退款成功',
        2 => '退款失败'
    ],
    //机票订单支付平台
    'plane_pay_platform' => [
        1 => '支付宝',
        2 => '微信'
    ],
    //乘机人机票状态
    'emplane_ticket_status' => [
        0 => '正常',
        1 => '退票申请中',
        2 => '退票成功',
        3 => '退票失败'
    ],
    //乘客机票类型
    'emplane_ticket_type' => [
        1 => '成人票',
    ],
    //机票乘机人证件类型
    'plane_card_type' => [
        0 => '身份证',
        1 => '护照',
        2 => '军官证',
    ],
    'person_status' => [
        0 => '待审核',
        1 => '已通过',
        2 => '未通过',
        3 => '待完善',
    ],

    /*'http_url' => [
        //'url' => 'http://192.168.66.139:9090',
        'url' => 'https://prejapis.tgljweb.com',

    ],*/
    'http_url' => [
        //'url' => 'http://192.168.66.139:9090',
        'url' => 'https://javapres.tgljweb.com',
        'http://106.14.239.108'    => 'https://prejapis.tgljweb.com',
        'http://139.196.252.26'    => 'https://javapres.tgljweb.com',
        'http://admin.tgljweb.com' => 'https://javaapis.tgljweb.com',
        'http://139.196.144.250'   => 'https://javaapis.tgljweb.com',
        'http://www.admin.com'     => 'https://prejapis.tgljweb.com',
    ],
    'comment_status' => [
        0 => '待审核',
        1 => '已通过',
        2 => '未通过',
    ],
    'comment_type' => [
        3 => '旅游主题',
        2 => '旅游活动',
    ],

    //民宿317版本后，新添加的与民宿相关的枚举值，都放在house枚举下
    'house' => [
        //ys@2017/11/1 民宿320，会员列表页【用户类型筛选条件】
        'house_user_auth_option' => [
            1 => '已填写实名信息',
            2 => '未填写实名信息',
        ],
        //fuyanfei@2017/11/2 民宿320，资质认证状态
        'house_auth_status' => [
            1 => "待审核",
            2 => "审核成功",
            3 => "审核未通过",
        ],
        //fuyanfei@2017/11/2 民宿320，审核状态
        'house_check_status' => [
            2 => '通过',
            3 => '不通过',
        ],
        //fuyanfei@2017/11/2 民宿320，审核不通过的原因
        'house_check_reason' => [
            1 => '照片模糊不清晰',
            2 => '照片非身份证照片',
            3 => '姓名与照片中不对应',
            4 => '身份证号与照片中不对应',
        ],
        //fuyanfei@2017/11/6 民宿320，房源订单预定类型
        'house_reserve_type' => [
            0 => '非速订',
            1 => '速订',
        ],
        //fuyanfei@2017/11/7 民宿320，房屋图片的标签
        'house_img_label' => [
            0 => '未配置',
            1 => '客厅',
            2 => '书房',
            3 => '卧室',
            4 => '厨房',
            5 => '卫生间',
            6 => '阳台',
            7 => '外景',
            8 => '周边',
        ],
        //fuyanfei@2017/11/7 民宿320，房屋质量权重配置
        'house_quality_rank_rule' => [
            'house_img'         => '0.4',
            'text_description' => '0.3',
            'renovation'        => '0.1',
            'bedding'           => '0.1',
            'dry_wet'           => '0.1',
        ],
        'house_quality_rank_base' => 250000,    //房源质量rank值的基数
        'house_quality_total_score' => 5,       //房源质量中每项的总分数
    ],
    'comment_status' => [
        0 => '待审核',
        1 => '已通过',
        2 => '未通过',
    ],
    'comment_type' => [
        3 => '旅游主题',
        2 => '旅游活动',
    ],


    //< -- 大交通2.0,，邮件发送系统，需要通知的人的邮箱 -- >
    'plane_ticket_post_person_list' => [
        //< -- 大交通2.0，保险相关业务操作异常发送邮件接收人（人工补出保异常 + 人工退保异常） -- >
        'handle_insurance_abnormal_post' => [
            0 => 'yuanshuai@tangguogo.com',
            1 => 'xiaochangxing@tangguogo.com',
            2 => 'chenyubao@tangguogo.com',
            3 => 'wangyunzhi@tangguogo.com',
            4 => 'fuyanfei@tangguogo.com',
            5 => 'wangxue@tangguogo.com',
        ],
    ]

];
