<?php
namespace backend\components;

/**
 * 短信服务消息常量定义类
 *
 * @author hongcq
 *
 */
class SmsConsts
{
    //短信服务账号
    const USER_GUONEI = 'N5879106';
    //短信服务密码
    const PWD_GUONEI = 'UnLQ0ykXSua0b0';

    const TRAVEL_DAREN = '【棠果旅居】有客人预订“%s”，联系人姓名：%s，电话：%s，%s人。';
    const TRAVEL_USER = '【棠果旅居】您已成功预订棠果旅居《%s》，您的订单号是：%s，活动时间：%s，活动咨询请加掌柜的微信：330224110';

    /****旅行用户短信模板****/
    //生成订单未支付5分钟后提示支付
    const  TRAVEL_ORDER_UNPAY_U = '【棠果旅居】您预订的《%s》订单将于10分钟后取消，请及时支付！如有任何疑问，请致电客服热线4006-406-111。';
    //支付成功无需确认
    const  TRAVEL_ORDER_PAY_UNCONFIRM_U = '【棠果旅居】您购买的《%s》已支付成功，订单号：%s，体验日期：%s，祝您有个愉快的假期；如有任何疑问，请致电客服热线4006-406-111。';
    //支付成功需要确认
    const  TRAVEL_ORDER_PAY_CONFIRM_U = '【棠果旅居】您购买的《%s》已支付成功，订单号：%s，体验日期：%s，供应商将在24小时内确认，请耐心等待；如有任何疑问，请联系供应商或致电客服热线4006-406-111。';
    //达人确认订单
    const  TRAVEL_ORDER_CONFIRM_U = '【棠果旅居】您预订的《%s》订单号：%s，体验日期：%s，供应商已确认，请如期参加，祝您有个愉快的假期；如有任何疑问，请联系供应商或致电客服热线4006-406-111。';
    //达人拒绝订单
    const  TRAVEL_ORDER_REFUSE_U = '【棠果旅居】您预订的《%s》订单号：%s，体验日期：%s，供应商已拒绝，退款金额将原路返回，预计3至7个工作日到账；如有任何疑问，请联系供应商或致电客服热线4006-406-111。';
    //体验日期前一天提醒（发送短信时间：12：00）
    const  TRAVEL_ORDER_BEFORE_GO_U = '【棠果旅居】您购买的《%s》体验日期：%s，请如期参加。';
    //用户发起退款
    const  TRAVEL_ORDER_REFUND_U = '【棠果旅居】您购买的《%s》订单号：%s，体验日期：%s，已申请退款，请耐心等待，我们将尽快为您处理；如有任何疑问，请联系供应商或致电客服热线4006-406-111。';
    //退款成功
    const  TRAVEL_ORDER_REFUND_SUCCESS_U = '【棠果旅居】您购买的《%s》订单号：%s，体验日期：%s，已退款成功，退款金额将原路返回，预计3至7个工作日到账；如有任何疑问，请联系供应商或致电客服热线4006-406-111。';
    //退款失败
    const  TRAVEL_ORDER_REFUND_FAIL_U = '【棠果旅居】您申请退款的《%s》订单号：%s，体验日期：%s，退款失败；如有任何疑问，请联系供应商或致电客服热线4006-406-111。';

    /****旅行达人短信模板****/
    //用户支付成功无需确认
    const  TRAVEL_ORDER_PAY_UNCONFIRM_D = '【棠果旅居】客人已成功购买《%s》，订单号：%s，体验日期：%s，请及时联系客人正常安排出行。';
    //用户支付成功需要确认
    const  TRAVEL_ORDER_PAY_CONFIRM_D = '【棠果旅居】客人已成功购买《%s》，订单号：%s，体验日期：%s，请24小时内确认订单，确认后请及时联系客人。';
    //用户申请退款
    const  TRAVEL_ORDER_REFUND_D = '【棠果旅居】您的《%s》客人已发起退款，订单号：%s，体验日期：%s，请尽快处理；如有任何疑问，请致电客服热线4006-406-111。';

    /*****  机票相关操作触发的发送短信提示功能  *******/
    //人工补出保成功，给乘机人发送提示短信
    const PLANE_TICKET_ADD_INSURANCE_SERVICE_SUCCESS = '【棠果旅居】您所投保的%s已承保，%s保单号：%s。您可拨打%s查询。';
    //人工退保成功，给乘机人发送提示短信
    const PLANE_TICKET_REFUND_INSURANCE_SERVICE_SUCCESS = '【棠果旅居】您所投保的%s，%s保单号：%s，已退保成功，预计3个工作日到账。您可拨打%s查询';

}
